In [130]:
# import all libraries
import numpy as np
import pandas as pd
import os
import datetime

In [423]:
os.getcwd()
os.path.exists("/Users/zeinab/Downloads/Project1_data")

True

# Read all sheet in a year

In [692]:
#all datasets
all_files_name = ["R98.xlsx", "R99.xlsx", "R1400.xlsx", "R1401.xlsx", "U98.xlsx", "U99.xlsx", "U1400.xlsx", "U1401.xlsx"]
path_data = "/Users/zeinab/Downloads/Project1_data/"
Year = "U98"

In [693]:
# #Read all sheets for a Year
# data = pd.read_excel(path_data + all_files_name[3], Year + 'Data')
# P1 = pd.read_excel(path_data + all_files_name[3], Year + 'P1')
P2 = pd.read_excel(path_data + all_files_name[4], Year + 'P2',index_col=False)
# P3S01 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S01')
# P3S02 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S02')
# P3S03 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S03')
P3S04 = pd.read_excel(path_data + all_files_name[4], Year + 'P3S04',index_col=False)
# P3S05 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S05')
# P3S06 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S06')
# P3S07 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S07')
# P3S08 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S08')
# P3S09 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S09')
# P3S11 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S11')
# P3S12 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S12')
# P3S13 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S13')
# P3S14 = pd.read_excel(path_data + all_files_name[3], Year + 'P3S14')
# P4S01 = pd.read_excel(path_data + all_files_name[3], Year + 'P4S01')
# P4S02 = pd.read_excel(path_data + all_files_name[3], Year + 'P4S02')
# P4S03 = pd.read_excel(path_data + all_files_name[3], Year + 'P4S03')
# P4S04 = pd.read_excel(path_data + all_files_name[3], Year + 'P4S04')

In [ ]:
data.info()

# Question 1

In [ ]:
P1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64296 entries, 0 to 64295
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Address         64296 non-null  int64
 1   member          64296 non-null  int64
 2   relation        64296 non-null  object
 3   gender          64296 non-null  object
 4   age             64296 non-null  int64
 5   literacy        58057 non-null  object
 6   studying        45177 non-null  object
 7   degree          45177 non-null  object
 8   occupationalst  53608 non-null  object
 9   maritalst       53609 non-null  object
dtypes: int64(3), object(7)
memory usage: 4.9+ MB

In [ ]:
P1[["degree","age"]]
# len(P1_test.literacy[ P1_test.literacy.isna()])

In [ ]:
P1_test = P1[["Address", "relation", "age", "degree", "occupationalst"]]

In [ ]:
P1_test.literacy.head(40)

In [ ]:
P1_test.shape

(64296, 5)

In [ ]:
len(P1_test.age[P1_test.age < 6])

6212

In [ ]:
P1_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6212 entries, 32 to 64287
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Address         6212 non-null   int64
 1   relation        6212 non-null   object
 2   age             6212 non-null   int64
 3   literacy        6212 non-null   object
 4   studying        0 non-null      object
 5   degree          0 non-null      object
 6   occupationalst  0 non-null      object
dtypes: int64(2), object(5)
memory usage: 388.2+ KB

In [ ]:
df = P1_test[P1_test.age < 6]
df.degree.fillna("illiterate", inplace=True)
df.occupationalst.fillna("Other",inplace=True)

/var/folders/7y/37m2bn3d6y778v332m4hd77c0000gn/T/ipykernel_45152/3478443372.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.degree.fillna("illiterate", inplace=True)
/var/folders/7y/37m2bn3d6y778v332m4hd77c0000gn/T/ipykernel_45152/3478443372.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.occupationalst.fillna("Other",inplace=True)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6212 entries, 32 to 64287
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Address         6212 non-null   int64
 1   relation        6212 non-null   object
 2   age             6212 non-null   int64
 3   degree          6212 non-null   object
 4   occupationalst  6212 non-null   object
dtypes: int64(2), object(3)
memory usage: 291.2+ KB

In [ ]:
# find all age < 6 and fill the null cells
dele = P1_test[P1_test.age < 6]
dele = P1_test[((P1_test.age < 6))].index
P1_test = P1_test.drop(dele)
P1_test = pd.concat([P1_test, df])

In [ ]:
P1_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 64296 entries, 0 to 64287
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Address         64296 non-null  int64
 1   relation        64296 non-null  object
 2   age             64296 non-null  int64
 3   degree          51389 non-null  object
 4   occupationalst  59820 non-null  object
dtypes: int64(2), object(3)
memory usage: 2.9+ MB

In [ ]:
P1_test.degree.value_counts()

Elemantry     21647
Secondary     10061
Diploma        6953
illiterate     6212
HighSchool     2439
Bachelor       2356
College         968
Other           400
Master          341
PhD              12
Name: degree, dtype: int64

In [ ]:
P1_test[P1_test.degree.isna()].describe()

Unexpected exception formatting exception. Falling back to standard exception

Traceback (most recent call last):
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/formatters.py", line 221, in catch_format_error
    r = method(self, *args, **kwargs)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/formatters.py", line 342, in __call__
    return method()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/core/frame.py", line 1106, in _repr_html_
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/format.py", line 1110, in to_html
    When formatting an Index subclass
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 88, in to_string
    lines = self.render()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 644, in render
    super().render()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 94, in render
    self._write_table()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 267, in _write_table
    self._write_header(indent + self.indent_delta)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 403, in _write_header
    self._write_col_header(indent + self.indent_delta)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 383, in _write_col_header
    row.extend(self._get_columns_formatted_values())
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 611, in _get_columns_formatted_values
    return self.columns._format_flat(include_name=False)
AttributeError: 'Index' object has no attribute '_format_flat'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/interactiveshell.py", line 2057, in showtraceback
    stb = self.InteractiveTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 1118, in structured_traceback
    return FormattedTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 1012, in structured_traceback
    return VerboseTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 865, in structured_traceback
    formatted_exception = self.format_exception_as_a_whole(etype, evalue, etb, number_of_lines_of_context,
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 818, in format_exception_as_a_whole
    frames.append(self.format_record(r))
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 736, in format_record
    result += ''.join(_format_traceback_lines(frame_info.lines, Colors, self.has_colors, lvals))
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 734, in lines
    pieces = self.included_pieces
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 681, in included_pieces
    pos = scope_pieces.index(self.executing_piece)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 660, in executing_piece
    return only(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/executing/executing.py", line 190, in only
    raise NotOneValueFound('Expected one value, found 0')
executing.executing.NotOneValueFound: Expected one value, found 0

            Address           age
count  1.290700e+04  12907.000000
mean   2.141166e+10     59.236616
std    8.974780e+08     17.695877
min    2.000138e+10      6.000000
25%    2.061446e+10     50.000000
50%    2.130654e+10     61.000000
75%    2.220462e+10     71.000000
max    2.300671e+10     99.000000

In [ ]:
P1_test[P1_test.degree.isna()]

In [ ]:
P1_test.degree.fillna("Other",inplace=True)

In [ ]:
P1_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 64296 entries, 0 to 64287
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Address         64296 non-null  int64
 1   relation        64296 non-null  object
 2   age             64296 non-null  int64
 3   degree          64296 non-null  object
 4   occupationalst  59820 non-null  object
dtypes: int64(2), object(3)
memory usage: 2.9+ MB

In [ ]:
P1_test.occupationalst.value_counts()

employed       19290
Housewife      16485
Student         8602
Other           7430
IncomeWOJob     5398
unemployed      2615
Name: occupationalst, dtype: int64

In [ ]:
P1_test[P1_test.occupationalst.isna()].describe()

Unexpected exception formatting exception. Falling back to standard exception

Traceback (most recent call last):
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/formatters.py", line 221, in catch_format_error
    r = method(self, *args, **kwargs)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/formatters.py", line 342, in __call__
    return method()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/core/frame.py", line 1106, in _repr_html_
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/format.py", line 1110, in to_html
    When formatting an Index subclass
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 88, in to_string
    lines = self.render()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 644, in render
    super().render()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 94, in render
    self._write_table()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 267, in _write_table
    self._write_header(indent + self.indent_delta)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 403, in _write_header
    self._write_col_header(indent + self.indent_delta)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 383, in _write_col_header
    row.extend(self._get_columns_formatted_values())
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 611, in _get_columns_formatted_values
    return self.columns._format_flat(include_name=False)
AttributeError: 'Index' object has no attribute '_format_flat'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/interactiveshell.py", line 2057, in showtraceback
    stb = self.InteractiveTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 1118, in structured_traceback
    return FormattedTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 1012, in structured_traceback
    return VerboseTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 865, in structured_traceback
    formatted_exception = self.format_exception_as_a_whole(etype, evalue, etb, number_of_lines_of_context,
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 818, in format_exception_as_a_whole
    frames.append(self.format_record(r))
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 736, in format_record
    result += ''.join(_format_traceback_lines(frame_info.lines, Colors, self.has_colors, lvals))
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 734, in lines
    pieces = self.included_pieces
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 681, in included_pieces
    pos = scope_pieces.index(self.executing_piece)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 660, in executing_piece
    return only(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/executing/executing.py", line 190, in only
    raise NotOneValueFound('Expected one value, found 0')
executing.executing.NotOneValueFound: Expected one value, found 0

            Address          age
count  4.476000e+03  4476.000000
mean   2.148921e+10     7.476765
std    8.797756e+08     1.102621
min    2.000138e+10     6.000000
25%    2.071347e+10     6.000000
50%    2.140655e+10     7.000000
75%    2.221063e+10     8.000000
max    2.300671e+10     9.000000

In [ ]:
P1_test.occupationalst.fillna("Other",inplace=True)

In [ ]:
P1_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 64296 entries, 0 to 64287
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Address         64296 non-null  int64
 1   relation        64296 non-null  object
 2   age             64296 non-null  int64
 3   degree          64296 non-null  object
 4   occupationalst  64296 non-null  object
dtypes: int64(2), object(3)
memory usage: 2.9+ MB

# Question 2

In [ ]:
P2.keys()

Index(['Address', 'tenure', 'room', 'space', 'construction', 'material',
       'vehicle', 'motorcycle', 'bicycle', 'radio', 'radiotape', 'TVbw', 'TV',
       'VHS_VCD_DVD', 'computer', 'cellphone', 'freezer', 'refridgerator',
       'fridge', 'stove', 'vacuum', 'washingmachine', 'sewingmachine', 'fan',
       'evapcoolingportable', 'splitportable', 'dishwasher', 'microwave',
       'none', 'pipewater', 'electricity', 'pipegas', 'telephone', 'internet',
       'bathroom', 'kitchen', 'evapcooling', 'centralcooling',
       'centralheating', 'package', 'split', 'wastewater', 'cookingfuel',
       'heatingfuel', 'waterheatingfuel'],
      dtype='object')

In [ ]:
P2_test = P2[["Address", "vehicle", "motorcycle", "bicycle"]]

In [ ]:
P2_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18430 entries, 0 to 18429
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Address     18430 non-null  int64
 1   vehicle     18430 non-null  bool
 2   motorcycle  18430 non-null  bool
 3   bicycle     18430 non-null  bool
dtypes: bool(3), int64(1)
memory usage: 198.1 KB

# Question 4

In [ ]:
P3S11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11269 entries, 0 to 11268
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Address    11269 non-null  int64
 1   code       11269 non-null  int64
 2   purchased  11269 non-null  int64
 3   value      11269 non-null  int64
dtypes: int64(4)
memory usage: 352.3 KB

In [ ]:
P3S04

Unexpected exception formatting exception. Falling back to standard exception

Traceback (most recent call last):
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/formatters.py", line 221, in catch_format_error
    r = method(self, *args, **kwargs)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/formatters.py", line 342, in __call__
    return method()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/core/frame.py", line 1106, in _repr_html_
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/format.py", line 1110, in to_html
    When formatting an Index subclass
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 88, in to_string
    lines = self.render()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 644, in render
    super().render()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 94, in render
    self._write_table()
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 267, in _write_table
    self._write_header(indent + self.indent_delta)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 403, in _write_header
    self._write_col_header(indent + self.indent_delta)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 383, in _write_col_header
    row.extend(self._get_columns_formatted_values())
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/pandas/io/formats/html.py", line 611, in _get_columns_formatted_values
    return self.columns._format_flat(include_name=False)
AttributeError: 'Index' object has no attribute '_format_flat'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/interactiveshell.py", line 2057, in showtraceback
    stb = self.InteractiveTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 1118, in structured_traceback
    return FormattedTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 1012, in structured_traceback
    return VerboseTB.structured_traceback(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 865, in structured_traceback
    formatted_exception = self.format_exception_as_a_whole(etype, evalue, etb, number_of_lines_of_context,
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 818, in format_exception_as_a_whole
    frames.append(self.format_record(r))
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/IPython/core/ultratb.py", line 736, in format_record
    result += ''.join(_format_traceback_lines(frame_info.lines, Colors, self.has_colors, lvals))
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 734, in lines
    pieces = self.included_pieces
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 681, in included_pieces
    pos = scope_pieces.index(self.executing_piece)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/stack_data/core.py", line 660, in executing_piece
    return only(
  File "/Users/zeinab/Documents/venv/lib/python3.9/site-packages/executing/executing.py", line 190, in only
    raise NotOneValueFound('Expected one value, found 0')
executing.executing.NotOneValueFound: Expected one value, found 0

           Address   code  mortgage purchased    value
0      20011395420  42111       NaN       NaN  1000000
1      20011395420  44418       NaN         1    20000
2      20011395420  45111       NaN         1   350000
3      20011395420  45211       NaN         1   200000
4      20001385412  42111       NaN       NaN  1500000
...            ...    ...       ...       ...      ...
68762  23006709423  44411       NaN         1   200000
68763  23006709423  44412       NaN         1   200000
68764  23006709423  44413       NaN         1   100000
68765  23006709423  45111       NaN         1   450000
68766  23006709423  45211       NaN         1   320000

[68767 rows x 5 columns]

# Fateme - arzesh khane U & R

# Fateme - arzesh khane U & R - edition 2

In [701]:
P2_test = P2[['Address', 'space']]

In [702]:
U98P3S04 = P3S04[P3S04.code ==  42212]
U98P3S04.shape

(3491, 5)

In [703]:
(list(map(lambda x: x in list(U98P3S04.Address), list(P2_test.Address)))).count(True)

3491

In [704]:
U98P3S04.set_index('Address', inplace=True)
P2_test.set_index('Address', inplace=True)

In [705]:
# meterR1401['mortgage'] = pd.to_numeric(meterR1401['mortgage'], errors='coerce')

 - dollar98 = 134607
 - dollar99 = 236036
 - dollar1400 = 267272
 - dollar1401 = 386627

In [707]:
meterU98 = pd.concat([P2_test, U98P3S04], axis=1, join="inner")
meterU98['mortgage'] = pd.to_numeric(meterU98['mortgage'], errors='coerce')
meterU98['per_meter'] = meterU98['mortgage'] / meterU98['space']
meterU98['per_meter'] = meterU98['per_meter'] / 134607
meterU98 = meterU98.rename_axis(index=None, columns='Address')

In [708]:
meterU98 = meterU98[~meterU98.per_meter.isna()]

In [709]:
meterU98.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3489 entries, 10004004220 to 13001376708
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   space      3489 non-null   int64
 1   code       3489 non-null   int64
 2   mortgage   3489 non-null   float64
 3   purchased  3489 non-null   object
 4   value      3489 non-null   int64
 5   per_meter  3489 non-null   float64
dtypes: float64(2), int64(3), object(1)
memory usage: 190.8+ KB

In [689]:
meterU99 = meterU99[~meterU99.per_meter.isna()]

In [690]:
meterU99.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3328 entries, 10005004619 to 13001372414
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   space      3328 non-null   int64
 1   code       3328 non-null   int64
 2   mortgage   3328 non-null   float64
 3   purchased  3328 non-null   object
 4   value      3328 non-null   int64
 5   per_meter  3328 non-null   float64
dtypes: float64(2), int64(3), object(1)
memory usage: 182.0+ KB

In [687]:
meterU1400 = meterU1400[~meterU1400.per_meter.isna()]

In [688]:
meterU1400.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1004 entries, 10006005930 to 13001379825
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   space      1004 non-null   int64
 1   code       1004 non-null   int64
 2   mortgage   1004 non-null   float64
 3   purchased  1004 non-null   object
 4   value      1004 non-null   int64
 5   per_meter  1004 non-null   float64
dtypes: float64(2), int64(3), object(1)
memory usage: 54.9+ KB

In [685]:
meterU1401 = meterU1401[~meterU1401.per_meter.isna()]

In [686]:
meterU1401.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3342 entries, 10001000226 to 13006383438
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   space      3342 non-null   float64
 1   code       3342 non-null   int64
 2   mortgage   3342 non-null   int64
 3   purchased  3342 non-null   object
 4   value      3342 non-null   int64
 5   per_meter  3342 non-null   float64
dtypes: float64(2), int64(3), object(1)
memory usage: 311.8+ KB

In [683]:
meterR1401 = meterR1401[~meterR1401.per_meter.isna()]

In [684]:
meterR1401.info()

<class 'pandas.core.frame.DataFrame'>
Index: 626 entries, 22105613726 to 22007607441
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   space      626 non-null    float64
 1   code       626 non-null    int64
 2   mortgage   626 non-null    int64
 3   purchased  626 non-null    object
 4   value      626 non-null    int64
 5   per_meter  626 non-null    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 34.2+ KB

In [681]:
meterR1400 = meterR1400[~meterR1400.per_meter.isna()]

In [682]:
meterR1400.info()

<class 'pandas.core.frame.DataFrame'>
Index: 654 entries, 20001384621 to 23003707035
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   space      654 non-null    int64
 1   code       654 non-null    int64
 2   mortgage   654 non-null    float64
 3   purchased  654 non-null    object
 4   value      654 non-null    int64
 5   per_meter  654 non-null    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 35.8+ KB

In [679]:
meterR99=meterR99[~meterR99.per_meter.isna()]

In [680]:
meterR99.info()

<class 'pandas.core.frame.DataFrame'>
Index: 620 entries, 20001384620 to 23003707029
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   space      620 non-null    int64
 1   code       620 non-null    int64
 2   mortgage   620 non-null    float64
 3   purchased  620 non-null    object
 4   value      620 non-null    int64
 5   per_meter  620 non-null    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 33.9+ KB

In [677]:
meterR98=meterR98[~meterR98.per_meter.isna()]

In [678]:
meterR98.info()

<class 'pandas.core.frame.DataFrame'>
Index: 614 entries, 20007391408 to 23006709014
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   space      614 non-null    int64
 1   code       614 non-null    int64
 2   mortgage   614 non-null    float64
 3   purchased  614 non-null    object
 4   value      614 non-null    int64
 5   per_meter  614 non-null    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 33.6+ KB

In [710]:
all_u = pd.concat([meterU98, meterU99, meterU1400, meterU1401])
all_r = pd.concat([meterR98, meterR99, meterR1400, meterR1401])

In [712]:
all_u

Address      space   code      mortgage purchased      value   per_meter
10004004220   58.0  42212  1.000000e+08         1    3000000   12.808680
10013010608   60.0  42212  5.000000e+07         1    1500000    6.190862
10009008108  160.0  42212  6.000000e+07         1    1800000    2.785888
10001000620  100.0  42212  9.000000e+07         1    2700000    6.686131
10005004623  110.0  42212  4.000000e+08         1    1200000   27.014670
...            ...    ...           ...       ...        ...         ...
13003381826   75.0  42212  3.000000e+08         1    9000000   10.345889
13003381838   78.0  42212  5.000000e+08         1   15000000   16.579950
13006382727   60.0  42212  4.000000e+08         1   12000000   17.243148
13006382729   70.0  42212  5.000000e+08         1   15000000   18.474802
13006383438   90.0  42212  4.000000e+09         1  120000000  114.954321

[11163 rows x 6 columns]

In [711]:
all_u.keys()

Index(['space', 'code', 'mortgage', 'purchased', 'value', 'per_meter'], dtype='object', name='Address')

In [713]:
all_u = all_u.drop(['space', 'code', 'mortgage', 'purchased', 'value'], axis=1)
all_r = all_r.drop(['space', 'code', 'mortgage', 'purchased', 'value'], axis=1)

In [715]:
all_u

Address       per_meter
10004004220   12.808680
10013010608    6.190862
10009008108    2.785888
10001000620    6.686131
10005004623   27.014670
...                 ...
13003381826   10.345889
13003381838   16.579950
13006382727   17.243148
13006382729   18.474802
13006383438  114.954321

[11163 rows x 1 columns]

In [716]:
all_r

Address      per_meter
20007391408   0.742898
20005388614   0.619082
20215411908  27.858671
20219413520   2.228694
20210410717   7.428979
...                ...
22003603832   0.323309
22003603838  20.691778
22006606229   0.646618
22007607425   0.431079
22007607441  25.864722

[2514 rows x 1 columns]

In [714]:
print(all_u.shape)
print(all_r.shape)

(11163, 1)
(2514, 1)

In [718]:
all_u.to_csv('U_arzesh_khane.csv', encoding='utf-8', index=False)
all_r.to_csv('R_arzesh_khane.csv', encoding='utf-8', index=False)

# Change all Costs To Dollars

In [ ]:
# read Dollars file
dollar = pd.read_csv("/Users/zeinab/Downloads/Project1_data/Dollar+.csv")

In [ ]:
dollar.keys()

Index(['date', 'close', 'high', 'low', 'open', 'time', 'volume', 'date.1'], dtype='object')

In [ ]:
dollar = dollar.drop(['high', 'low', 'open', 'time', 'volume', 'date.1'], axis=1)

In [ ]:
dollar

             date      close
0      1975-07-09      68.73
1      1975-07-10      68.73
2      1975-07-11      68.73
3      1975-07-12      68.73
4      1975-07-13      68.73
...           ...        ...
17640  2023-10-25  511500.00
17641  2023-10-26  517000.00
17642  2023-10-27  517000.00
17643  2023-10-28  521500.00
17644  2023-10-29  520000.00

[17645 rows x 2 columns]

In [ ]:
from datetime import datetime
dollar['date'] = dollar['date'].apply(lambda x: datetime.strptime(x, '%Y-%m-%d'))

In [ ]:
dollar

            date      close
0     1975-07-09      68.73
1     1975-07-10      68.73
2     1975-07-11      68.73
3     1975-07-12      68.73
4     1975-07-13      68.73
...          ...        ...
17640 2023-10-25  511500.00
17641 2023-10-26  517000.00
17642 2023-10-27  517000.00
17643 2023-10-28  521500.00
17644 2023-10-29  520000.00

[17645 rows x 2 columns]

In [ ]:
list_year = []
list_month = []
list_day = []
for i in range(len(dollar.date)):
    list_year.append(dollar.date[i].year)
    list_month.append(dollar.date[i].month)
    list_day.append(dollar.date[i].day)

In [ ]:
dollar['year'] = list_year
dollar['month'] = list_month
dollar['day'] = list_day

In [ ]:
dollar

            date      close  year  month  day
0     1975-07-09      68.73  1975      7    9
1     1975-07-10      68.73  1975      7   10
2     1975-07-11      68.73  1975      7   11
3     1975-07-12      68.73  1975      7   12
4     1975-07-13      68.73  1975      7   13
...          ...        ...   ...    ...  ...
17640 2023-10-25  511500.00  2023     10   25
17641 2023-10-26  517000.00  2023     10   26
17642 2023-10-27  517000.00  2023     10   27
17643 2023-10-28  521500.00  2023     10   28
17644 2023-10-29  520000.00  2023     10   29

[17645 rows x 5 columns]

In [ ]:
dollar.year = dollar.year[dollar.year > 2018]
dollar = dollar[~dollar.year.isna()]

In [ ]:
dollar

            date     close    year  month  day
15882 2019-01-01  104900.0  2019.0      1    1
15883 2019-01-02  106700.0  2019.0      1    2
15884 2019-01-03  107000.0  2019.0      1    3
15885 2019-01-04  107200.0  2019.0      1    4
15886 2019-01-05  106700.0  2019.0      1    5
...          ...       ...     ...    ...  ...
17640 2023-10-25  511500.0  2023.0     10   25
17641 2023-10-26  517000.0  2023.0     10   26
17642 2023-10-27  517000.0  2023.0     10   27
17643 2023-10-28  521500.0  2023.0     10   28
17644 2023-10-29  520000.0  2023.0     10   29

[1763 rows x 5 columns]

In [ ]:
dollar_2019 = dollar[dollar.year == 2019]
dollar_2020 = dollar[dollar.year == 2020]
dollar_2021 = dollar[dollar.year == 2021]
dollar_2022 = dollar[dollar.year == 2022]
dollar_2023 = dollar[dollar.year == 2023]

- 1398 = 21/3/2019 - 19/3/2020
- 1399 = 20/3/2020 - 20/3/2021
- 1400 = 21/3/2021 - 20/3/2022
- 1401 = 21/3/2022 - 20/3/2023

In [ ]:
dollar98_1 = dollar_2019.loc[dollar_2019['month'] > 2]
dollar98_1 = dollar98_1.loc[dollar98_1['day'] > 20]
dollar98_2 = dollar_2020.loc[dollar_2020['month'] < 4]
dollar98_2 = dollar98_2.loc[dollar98_2['day'] < 20]

In [ ]:
dollar98 = (dollar98_1.close.mean() + dollar98_2.close.mean()) / 2

In [ ]:
# 1399 = 20/3/2020 - 20/3/2021
dollar99_1 = dollar_2020.loc[dollar_2020['month'] > 2]
dollar99_1 = dollar99_1.loc[dollar99_1['day'] > 19]
dollar99_2 = dollar_2021.loc[dollar_2021['month'] < 4]
dollar99_2 = dollar99_2.loc[dollar99_2['day'] < 21]

In [ ]:
dollar99 = (dollar99_1.close.mean() + dollar99_2.close.mean()) / 2

In [ ]:
# 1400 = 21/3/2021 - 20/3/2022
dollar1400_1 = dollar_2021.loc[dollar_2021['month'] > 2]
dollar1400_1 = dollar1400_1.loc[dollar1400_1['day'] > 20]
dollar1400_2 = dollar_2022.loc[dollar_2022['month'] < 4]
dollar1400_2 = dollar1400_2.loc[dollar1400_2['day'] < 21]

In [ ]:
dollar1400 = (dollar1400_1.close.mean() + dollar1400_2.close.mean()) / 2

In [ ]:
# 1401 = 21/3/2022 - 20/3/2023
dollar1401_1 = dollar_2022.loc[dollar_2022['month'] > 2]
dollar1401_1 = dollar1401_1.loc[dollar1401_1['day'] > 20]
dollar1401_2 = dollar_2023.loc[dollar_2023['month'] < 4]
dollar1401_2 = dollar1401_2.loc[dollar1401_2['day'] < 21]

In [ ]:
dollar1401 = (dollar1401_1.close.mean() + dollar1401_2.close.mean()) / 2

In [ ]:
print(dollar98)
print(dollar99)
print(dollar1400)
print(dollar1401)

134607.03409467064
236036.9827586207
267272.66509433964
386627.1855345912

In [ ]:
print(int(dollar98))
print(int(dollar99))
print(int(dollar1400))
print(int(dollar1401))

134607
236036
267272
386627

 - dollar98 = 134607
 - dollar99 = 236036
 - dollar1400 = 267272
 - dollar1401 = 386627